{
  "experiences": [
    {
      "id": 2,
      "company": "OpenBank",
      "position": "Senior Backend Developer",
      "startDate": "2021-08",
      "endDate": "2024-12",
      "description": [
        {
          "name": "Document Management System (online)",
          "description": "During my time at OpenBank, I have participated in the development and maintenance of a set of microservices responsible for supporting all functionality related to the document management product. For this, I have been developing using Java, Spring Boot, and REST APIs, non-relational databases such as MongoDB, Redis, and OpenSearch. I have been developing components in Python. The environment where these developments run is a completely Cloud environment (in this case AWS) where performance is a key consideration since the requests received by the services may not only contain data in JSON format but can also include large files. I have worked with asynchronous event-based architectures and cloud storage systems as well."
        },
        {
          "name": "Document Management System (batch)",
          "description": "Within the same department, I also worked on the design, development, and maintenance of the necessary elements for activities that fall under document management but do not need to be performed on demand (i.e., they are not interactive). These activities used reactive processes (using SQS and SNS) that needed to be executed within specific time windows. For this, I worked on developments in Java, with Spring Boot and JMS, non-relational databases, external cloud-based storage systems (in this case AWS S3), and interaction with third-party tools. In this case, the most relevant point to highlight was the optimization work performed on the existing code, redesigning part of the solution to significantly increase performance using multithreading solutions and high-concurrency environments."
        },
        {
          "name": "Document Management System (migrations)",
          "description": "The third type of project I worked on were data migration projects. In this type of project, the point to highlight is the large volume of data and heavy files that the system had to handle. For this, I worked with systems based on Java, Spring Boot, storage systems, and integrations with other internal bank products. In this point, it is interesting to highlight the importance not only of the large volume of data to be processed but also of developing an inherent system to the migration process that made it possible to verify the process performed."
        }
      ],
      "technologies": [
        {
          "name": "Spring Boot",
          "image": "/images/technologies/springboot.png"
        },
        {
          "name": "Java",
          "image": "/images/technologies/java.png",
          "aclaracion": "Mainly with Java 11, 17 and 21"
        },
        {
          "name": "Python",
          "image": "/images/technologies/python.png"
        },
        {
          "name": "Git",
          "image": "/images/technologies/git.png"
        },
        {
          "name": "AWS",
          "image": "/images/technologies/aws.webp"
        },
        {
          "name": "MongoDB",
          "image": "/images/technologies/mongodb.png"
        },
        {
          "name": "Redis",
          "image": "/images/technologies/redis.png"
        },
        {
          "name": "OpenSearch",
          "image": "/images/technologies/opensearch.png"
        },
        {
          "name": "JUnit",
          "image": "/images/technologies/junit.png"
        },
        {
          "name": "PostgreSQL",
          "image": "/images/technologies/postgresql.png"
        },
        {
          "name": "Docker",
          "image": "/images/technologies/docker.png"
        },
        {
          "name": "Multithreading",
          "image": "/images/technologies/threads.webp"
        },
        {
          "name": "SQS",
          "image": "/images/technologies/sqs.png"
        },
        {
          "name": "SOAP",
          "image": "/images/technologies/soap.webp"
        },
        {
          "name": "REST",
          "image": "/images/technologies/rest.png"
        },
        {
          "name": "Swagger",
          "image": "/images/technologies/swagger.png"
        },
        {
          "name": "Maven",
          "image": "/images/technologies/mvn.png"
        }
      ],
      "responsibilities": [
        "Development and maintenance of microservices for document management using Java, Spring Boot, and REST APIs",
        "Work with NoSQL databases such as MongoDB, Redis, and OpenSearch",
        "Implementation of Python solutions to complement the microservices ecosystem",
        "Performance optimization in Cloud environments (AWS), handling large volumes of data and files",
        "Design and development of batch processes, applying asynchronous event-based architectures with SQS and SNS through JMS",
        "Use of cloud storage systems (AWS S3) and their integration with other bank tools",
        "Code optimization and performance improvement through multithreading and high-concurrency environments",
        "Migration of large volumes of data and files, ensuring verification and validation of processes"
      ],
      "companyLogo": "/images/companies/openbank.jpeg"
    },
    {
      "id": 3,
      "startDate": "2020-03",
      "endDate": "2021-08",
      "company": "Minsait",
      "companyLogo": "/images/companies/minsait.jpeg",
      "position": "Senior Backend Developer",
      "description": [
        {
          "name": "Integrated Electronic Voting System",
          "description": "During this period, I participated in the development of an electronic voting device. The device was developed from scratch, including exterior design, interior components, sensors... On this system, a web application was developed that served as an interface for the user to operate it. The web application was exposed/consumed through REST APIs. The frontend was implemented using Vue.js, the backend with Spring Boot, JPA, Spring State Machine, Aspect Oriented Programming, and Java 11, and an embedded relational database, PostgreSQL, was used. I also implemented a way of communication between devices using Kafka. In this project, I had to make modifications and developments in all layers of the stack, from sensor integration with the operating system, database, backend, and frontend."
        },
        {
          "name": "Integrated Biometric Identification System",
          "description": "After working on the electronic voting machine, I participated in a similar project but focused on biometric identification. The technological stack and general architecture were the same as those existing in the voting device, but since the purpose was different, modifications were made to the backend to support the new functionality and improve performance based on the technical specifications of the components that made up the device. I developed a way to 'emulate' the device environment through virtualization using Docker."
        },
        {
          "name": "Web Voting System",
          "description": "In the final period of my time at Minsait, I participated in a project that aimed to carry out verification and validation tests for conducting an electoral process through a web platform in Mexico. When I joined, the project was already developed but some modifications were needed to improve its performance and effectiveness. The project ran in a Cloud environment, specifically in AWS. This project, in addition to being interesting due to its technical complexity and criticality, was a first approach to reactive programming, using queues and events, to the Cloud execution environment, and to NoSQL databases, in this case MongoDB."
        }
      ],
      "technologies": [
        {
          "name": "Vue.js",
          "image": "/images/technologies/vue.png"
        },
        {
          "name": "PostgreSQL",
          "image": "/images/technologies/postgresql.png"
        },
        {
          "name": "Spring Boot",
          "image": "/images/technologies/springboot.png"
        },
        {
          "name": "Java",
          "image": "/images/technologies/java.png",
          "aclaracion": "Java 11 and 17"
        },
        {
          "name": "AWS",
          "image": "/images/technologies/aws.webp"
        },
        {
          "name": "MongoDB",
          "image": "/images/technologies/mongodb.png"
        },
        {
          "name": "JUnit",
          "image": "/images/technologies/junit.png"
        },
        {
          "name": "Kafka",
          "image": "/images/technologies/kafka.svg"
        },
        {
          "name": "Docker",
          "image": "/images/technologies/docker.png"
        },
        {
          "name": "Swagger",
          "image": "/images/technologies/swagger.png"
        },
        {
          "name": "Maven",
          "image": "/images/technologies/mvn.png"
        },
        {
          "name": "Git",
          "image": "/images/technologies/git.png"
        }
      ],
      "responsibilities": [
        "Full-stack development in software and hardware projects, working in all layers of the stack",
        "Design, development, and optimization of RESTful APIs with Spring Boot, JPA, and Java 11 and 17",
        "Implementation and maintenance of web applications with Vue.js",
        "Integration of sensors and hardware components with the operating system in specialized devices",
        "Performance optimization and system adaptation based on technical requirements",
        "Experience in reactive programming, working with queues and events",
        "Development in Cloud environments (AWS)",
        "Work with advanced architectures, including Spring State Machine, Aspect Oriented Programming, and microservices"
      ]
    },
    {
      "id": 4,
      "startDate": "2018-05",
      "endDate": "2020-03",
      "company": "VASS",
      "companyLogo": "/images/companies/vass.jpeg",
      "position": "Backend Developer",
      "description": [
        {
          "name": "Client: Telefonica - Identity Management",
          "description": "During this time, I was part of Telefónica's identity management department as external personnel. During this period, I had the opportunity to understand how a large company works and the importance of processes. This period marked the beginning of my journey as a backend developer, primarily focused on designing and developing RESTful APIs with Spring Boot. During this time, I started working with non-relational databases, such as LDAP, and also implemented integrations with external products through SOAP and REST. Additionally, although I was not directly involved in frontend projects, I did have to interact with them. For example, I developed the login for the Movistar customer application using Angular JS."
        }
      ],
      "technologies": [
        {
          "name": "Java",
          "image": "/images/technologies/java.png",
          "aclaracion": "Mainly with Java 8 and 11"
        },
        {
          "name": "Spring Boot",
          "image": "/images/technologies/springboot.png"
        },
        {
          "name": "LDAP",
          "image": "/images/technologies/ldap.png"
        },
        {
          "name": "SOAP",
          "image": "/images/technologies/soap.webp"
        },
        {
          "name": "REST",
          "image": "/images/technologies/rest.png"
        },
        {
          "name": "Angular",
          "image": "/images/technologies/angular.png"
        },
        {
          "name": "Oauth 2.0",
          "image": "/images/technologies/oauth2.png"
        },
        {
          "name": "JUnit",
          "image": "/images/technologies/junit.png"
        },
        {
          "name": "Swagger",
          "image": "/images/technologies/swagger.png"
        },
        {
          "name": "Maven",
          "image": "/images/technologies/mvn.png"
        },
        {
          "name": "Git",
          "image": "/images/technologies/git.png"
        }
      ],
      "responsibilities": [
        "Backend development focused on RESTful APIs using Spring Boot",
        "Integration with non-relational databases, particularly LDAP",
        "Implementation of integrations with external products through SOAP and REST",
        "Development of authentication systems, including the Movistar customer application login",
        "Work with Angular JS for frontend components",
        "Implementation of OAuth 2.0 for secure authentication",
        "Unit testing with JUnit",
        "API documentation using Swagger",
        "Project management with Maven",
        "Version control with Git"
      ]
    }
  ]
} 