{
  "projects": [
    {
      "id": 1,
      "name": "CherryPeach",
      "description": "CherryPeach is a social networking application that allows users to connect with nearby people in real-time. It works without internet or servers, using physical proximity to create direct and secure social interactions, maintaining user privacy by not storing personal data.",
      "technologies": [
      ],
      "features": [
        "Social connection based on physical proximity",
        "Operation without internet or servers",
        "Direct and secure social interactions",
        "Energy consumption optimization",
        "Low operational costs"
      ]
    },
    {
      "id": 2,
      "name": "Income Tax Deductions Web",
      "description": "Development of a web application that allows users to calculate their income tax deductions based on a form filled with their personal data.",
      "technologies": [
      ],
      "features": [
        "Use of AI for intensive documentation analysis",
        "Use of Python for document scraping",
        "Client-based web design to reduce product operational costs",
        "Use of AI for web interface design and development",
        "Use of PHP for server-side filtering and selection algorithms implementation"
      ],
      "demoUrl": "https://deduccionesrenta.com"
    },
    {
      "id": 3,
      "name": "Curriculum Vitae Web",
      "description": "Design and development of this same website to demonstrate the potential of AI from the perspective of development team optimization. This project serves as an example of how, through AI, a developer specialized in one field can expand their knowledge and skills to offer a higher quality product and be more versatile.",
      "technologies": [
        
      ],
      "features": [
        "Use of AI for web interface design and development",
        "Use of AI for web optimization for the user"
      ],
      "githubUrl": "https://github.com/AdrianLopez1994/cv",
      "demoUrl": "https://adrianlopezpisa.com"
    }
  ]
} 